'use strict';
//var message = age >= 21 ? "Allowed" : "Denied";
//val_res = cond_1_bool ? ((cond_1_1_bool || cond_1_2_bool) ? res_1_1 : res_1_2) : res_2_1;
let namePerson = 'Максим';
namePerson == 'Артем' ? 'директор' : 'Максим' ? 'преподаватель' : 'студент';
console.log(namePerson);

/*У нас есть переменная namePerson. Если значение этой переменной “Артем” то вывести в консоль “директор”, если значение “Максим” то вывести в консоль “преподаватель”, с любым другим значением вывести в консоль “студент”

  Решить задачу с помощью нескольких тернарных операторов, без использования if или switch
  

Переменная lang может принимать 2 значения: 'ru' 'en'.
Написать условия при котором в зависимости от значения lang будут выводится дни недели на русском или английском языке. Решите задачу

через if, 

через switch-case 

через многомерный массив без ифов и switch.







 */
